# SDC file generated by FishTail Refocus version 2017.07e
# From /nfs/iind/disks/dteg_disk008/users/badithya/dteg-stap/target/stap/ADL/mat1.5.3.p0_p1274.7/aceroot/results/DC/stap/collateral/fishtail/stap_clocks.tcl line 58
create_clock \
  -waveform { 0 1041.66666667 } \
  -period 2083.33333333 \
   { ftap_tck } \
  -name ftap_tck 

# From /nfs/iind/disks/dteg_disk008/users/badithya/dteg-stap/target/stap/ADL/mat1.5.3.p0_p1274.7/aceroot/results/DC/stap/collateral/fishtail/stap_clocks.tcl line 69
create_clock \
  -waveform { 0 1041.66666667 } \
  -period 2083.33333333 \
   { ftapsslv_tck } \
  -name ftapsslv_tck 

# SDC file generated by FishTail Refocus version 2017.07e
# From /nfs/iind/disks/dteg_disk008/users/badithya/dteg-stap/target/stap/ADL/mat1.5.3.p0_p1274.7/aceroot/results/DC/stap/collateral/fishtail/stap_io_constraints.tcl line 14
set_input_delay \
   208.333333333 \
  -clock { ftap_tck } \
   { fdfx_earlyboot_exit fdfx_policy_update fdfx_powergood fdfx_secure_policy[*] ftap_pwrdomain_rst_b ftap_slvidcode[*] ftap_tck ftap_tdi ftap_tms ftap_trst_b ftapsslv_tck ftapsslv_tdi ftapsslv_tms ftapsslv_trst_b rtdr_tap_tdo[*] sn_awtap_wso[*] sntapnw_atap_tdo sntapnw_atap_tdo2 sntapnw_atap_tdo2_en[*] sntapnw_atap_tdo_en[*] stap_abscan_tdo stap_isol_en_b tdr_data_in[*] } 

# From /nfs/iind/disks/dteg_disk008/users/badithya/dteg-stap/target/stap/ADL/mat1.5.3.p0_p1274.7/aceroot/results/DC/stap/collateral/fishtail/stap_io_constraints.tcl line 15
set_input_delay \
   0 \
  -clock { ftap_tck } \
   [get_ports { ftap_tck }] 

# From /nfs/iind/disks/dteg_disk008/users/badithya/dteg-stap/target/stap/ADL/mat1.5.3.p0_p1274.7/aceroot/results/DC/stap/collateral/fishtail/stap_io_constraints.tcl line 16
set_input_delay \
   208.333333333 \
  -clock { ftap_tck } \
   { fdfx_powergood } 

# From /nfs/iind/disks/dteg_disk008/users/badithya/dteg-stap/target/stap/ADL/mat1.5.3.p0_p1274.7/aceroot/results/DC/stap/collateral/fishtail/stap_io_constraints.tcl line 20
set_output_delay \
   104.166666667 \
  -clock { ftap_tck } \
   { atap_tdo atap_tdoen atapsslv_tdo atapsslv_tdoen sftapnw_ftap_enabletap[*] sftapnw_ftap_enabletdo[*] sftapnw_ftap_secsel[*] sn_fwtap_capturewr sn_fwtap_rti sn_fwtap_selectwir sn_fwtap_shiftwr sn_fwtap_updatewr sn_fwtap_wrck sn_fwtap_wrst_b sn_fwtap_wsi[*] sntapnw_ftap_tck sntapnw_ftap_tck2 sntapnw_ftap_tdi sntapnw_ftap_tdi2 sntapnw_ftap_tms sntapnw_ftap_tms2 sntapnw_ftap_trst2_b sntapnw_ftap_trst_b stap_fbscan_capturedr stap_fbscan_chainen stap_fbscan_d6actestsig_b stap_fbscan_d6init stap_fbscan_d6select stap_fbscan_extogen stap_fbscan_extogsig_b stap_fbscan_highz stap_fbscan_intest_mode stap_fbscan_mode stap_fbscan_runbist_en stap_fbscan_shiftdr stap_fbscan_tck stap_fbscan_updatedr stap_fbscan_updatedr_clk stap_fsm_tlrs tap_rtdr_capture[*] tap_rtdr_irdec[*] tap_rtdr_powergood tap_rtdr_prog_rst_b[*] tap_rtdr_rti tap_rtdr_selectir tap_rtdr_shift[*] tap_rtdr_tck tap_rtdr_tdi[*] tap_rtdr_update[*] tdr_data_out[*] } 

# From /nfs/iind/disks/dteg_disk008/users/badithya/dteg-stap/target/stap/ADL/mat1.5.3.p0_p1274.7/aceroot/results/DC/stap/collateral/fishtail/stap_io_constraints.tcl line 22
set_output_delay \
   104.166666667 \
  -clock { ftap_tck } \
   { atap_tdo atap_tdoen sftapnw_ftap_enabletap[*] sftapnw_ftap_enabletdo[*] sn_fwtap_capturewr sn_fwtap_shiftwr sn_fwtap_wsi[*] sntapnw_ftap_tdi stap_fbscan_capturedr stap_fbscan_mode stap_fsm_tlrs tap_rtdr_shift[*] tap_rtdr_tdi[*] tdr_data_out[*] } 

# From /nfs/iind/disks/dteg_disk008/users/badithya/dteg-stap/target/stap/ADL/mat1.5.3.p0_p1274.7/aceroot/results/DC/stap/collateral/fishtail/stap_io_constraints.tcl line 23
set_output_delay \
   104.166666667 \
  -clock { ftap_tck } \
   { stap_fbscan_d6init } 

# From /nfs/iind/disks/dteg_disk008/users/badithya/dteg-stap/target/stap/ADL/mat1.5.3.p0_p1274.7/aceroot/results/DC/stap/collateral/fishtail/stap_io_constraints.tcl line 24
set_output_delay \
   104.166666667 \
  -clock { ftap_tck } \
   { tap_rtdr_tck } 

# From /nfs/iind/disks/dteg_disk008/users/badithya/dteg-stap/target/stap/ADL/mat1.5.3.p0_p1274.7/aceroot/results/DC/stap/collateral/fishtail/stap_io_constraints.tcl line 25
set_output_delay \
   104.166666667 \
  -clock { ftap_tck } \
   { sn_fwtap_wrck } 

# From /nfs/iind/disks/dteg_disk008/users/badithya/dteg-stap/target/stap/ADL/mat1.5.3.p0_p1274.7/aceroot/results/DC/stap/collateral/fishtail/stap_io_constraints.tcl line 26
set_output_delay \
   104.166666667 \
  -clock { ftap_tck } \
   { sntapnw_ftap_tck } 

# From /nfs/iind/disks/dteg_disk008/users/badithya/dteg-stap/target/stap/ADL/mat1.5.3.p0_p1274.7/aceroot/results/DC/stap/collateral/fishtail/stap_io_constraints.tcl line 27
set_output_delay \
   104.166666667 \
  -clock { ftap_tck } \
   { stap_fbscan_capturedr stap_fbscan_chainen stap_fbscan_d6actestsig_b stap_fbscan_d6init stap_fbscan_d6select stap_fbscan_extogen stap_fbscan_extogsig_b stap_fbscan_highz stap_fbscan_intest_mode stap_fbscan_mode stap_fbscan_runbist_en stap_fbscan_shiftdr stap_fbscan_tck stap_fbscan_updatedr stap_fbscan_updatedr_clk } 

# From /nfs/iind/disks/dteg_disk008/users/badithya/dteg-stap/target/stap/ADL/mat1.5.3.p0_p1274.7/aceroot/results/DC/stap/collateral/fishtail/stap_io_constraints.tcl line 32
set_input_delay \
   208.333333333 \
  -clock { ftapsslv_tck } \
   { fdfx_earlyboot_exit fdfx_policy_update fdfx_powergood fdfx_secure_policy[*] ftap_pwrdomain_rst_b ftap_slvidcode[*] ftap_tck ftap_tdi ftap_tms ftap_trst_b ftapsslv_tck ftapsslv_tdi ftapsslv_tms ftapsslv_trst_b rtdr_tap_tdo[*] sn_awtap_wso[*] sntapnw_atap_tdo sntapnw_atap_tdo2 sntapnw_atap_tdo2_en[*] sntapnw_atap_tdo_en[*] stap_abscan_tdo stap_isol_en_b tdr_data_in[*] } 

# From /nfs/iind/disks/dteg_disk008/users/badithya/dteg-stap/target/stap/ADL/mat1.5.3.p0_p1274.7/aceroot/results/DC/stap/collateral/fishtail/stap_io_constraints.tcl line 33
set_input_delay \
   0 \
  -clock { ftapsslv_tck } \
   [get_ports { ftapsslv_tck }] 

# From /nfs/iind/disks/dteg_disk008/users/badithya/dteg-stap/target/stap/ADL/mat1.5.3.p0_p1274.7/aceroot/results/DC/stap/collateral/fishtail/stap_io_constraints.tcl line 34
set_input_delay \
   208.333333333 \
  -clock { ftapsslv_tck } \
   { fdfx_powergood } 

# From /nfs/iind/disks/dteg_disk008/users/badithya/dteg-stap/target/stap/ADL/mat1.5.3.p0_p1274.7/aceroot/results/DC/stap/collateral/fishtail/stap_io_constraints.tcl line 35
set_input_delay \
   104.166666667 \
  -clock { ftapsslv_tck } \
   { ftap_trst_b } 

# From /nfs/iind/disks/dteg_disk008/users/badithya/dteg-stap/target/stap/ADL/mat1.5.3.p0_p1274.7/aceroot/results/DC/stap/collateral/fishtail/stap_io_constraints.tcl line 36
set_input_delay \
   104.166666667 \
  -clock { ftapsslv_tck } \
   { ftap_pwrdomain_rst_b } 

# From /nfs/iind/disks/dteg_disk008/users/badithya/dteg-stap/target/stap/ADL/mat1.5.3.p0_p1274.7/aceroot/results/DC/stap/collateral/fishtail/stap_io_constraints.tcl line 39
set_output_delay \
   104.166666667 \
  -clock { ftapsslv_tck } \
   { atap_tdo atap_tdoen atapsslv_tdo atapsslv_tdoen sftapnw_ftap_enabletap[*] sftapnw_ftap_enabletdo[*] sftapnw_ftap_secsel[*] sn_fwtap_capturewr sn_fwtap_rti sn_fwtap_selectwir sn_fwtap_shiftwr sn_fwtap_updatewr sn_fwtap_wrck sn_fwtap_wrst_b sn_fwtap_wsi[*] sntapnw_ftap_tck sntapnw_ftap_tck2 sntapnw_ftap_tdi sntapnw_ftap_tdi2 sntapnw_ftap_tms sntapnw_ftap_tms2 sntapnw_ftap_trst2_b sntapnw_ftap_trst_b stap_fbscan_capturedr stap_fbscan_chainen stap_fbscan_d6actestsig_b stap_fbscan_d6init stap_fbscan_d6select stap_fbscan_extogen stap_fbscan_extogsig_b stap_fbscan_highz stap_fbscan_intest_mode stap_fbscan_mode stap_fbscan_runbist_en stap_fbscan_shiftdr stap_fbscan_tck stap_fbscan_updatedr stap_fbscan_updatedr_clk stap_fsm_tlrs tap_rtdr_capture[*] tap_rtdr_irdec[*] tap_rtdr_powergood tap_rtdr_prog_rst_b[*] tap_rtdr_rti tap_rtdr_selectir tap_rtdr_shift[*] tap_rtdr_tck tap_rtdr_tdi[*] tap_rtdr_update[*] tdr_data_out[*] } 

# From /nfs/iind/disks/dteg_disk008/users/badithya/dteg-stap/target/stap/ADL/mat1.5.3.p0_p1274.7/aceroot/results/DC/stap/collateral/fishtail/stap_io_constraints.tcl line 41
set_output_delay \
   104.166666667 \
  -clock { ftapsslv_tck } \
   { atap_tdo atap_tdoen sftapnw_ftap_enabletap[*] sftapnw_ftap_enabletdo[*] sn_fwtap_capturewr sn_fwtap_shiftwr sn_fwtap_wsi[*] sntapnw_ftap_tdi stap_fbscan_capturedr stap_fbscan_mode stap_fsm_tlrs tap_rtdr_shift[*] tap_rtdr_tdi[*] tdr_data_out[*] } 

# From /nfs/iind/disks/dteg_disk008/users/badithya/dteg-stap/target/stap/ADL/mat1.5.3.p0_p1274.7/aceroot/results/DC/stap/collateral/fishtail/stap_io_constraints.tcl line 42
set_output_delay \
   104.166666667 \
  -clock { ftapsslv_tck } \
   { stap_fbscan_d6init } 

# From /nfs/iind/disks/dteg_disk008/users/badithya/dteg-stap/target/stap/ADL/mat1.5.3.p0_p1274.7/aceroot/results/DC/stap/collateral/fishtail/stap_io_constraints.tcl line 43
set_output_delay \
   104.166666667 \
  -clock { ftapsslv_tck } \
   { tap_rtdr_tck } 

# From /nfs/iind/disks/dteg_disk008/users/badithya/dteg-stap/target/stap/ADL/mat1.5.3.p0_p1274.7/aceroot/results/DC/stap/collateral/fishtail/stap_io_constraints.tcl line 44
set_output_delay \
   104.166666667 \
  -clock { ftapsslv_tck } \
   { sn_fwtap_wrck } 

# From /nfs/iind/disks/dteg_disk008/users/badithya/dteg-stap/target/stap/ADL/mat1.5.3.p0_p1274.7/aceroot/results/DC/stap/collateral/fishtail/stap_io_constraints.tcl line 45
set_output_delay \
   104.166666667 \
  -clock { ftapsslv_tck } \
   { sntapnw_ftap_tck } 

# From /nfs/iind/disks/dteg_disk008/users/badithya/dteg-stap/target/stap/ADL/mat1.5.3.p0_p1274.7/aceroot/results/DC/stap/collateral/fishtail/stap_io_constraints.tcl line 46
set_output_delay \
   104.166666667 \
  -clock { ftapsslv_tck } \
   { stap_fbscan_capturedr stap_fbscan_chainen stap_fbscan_d6actestsig_b stap_fbscan_d6init stap_fbscan_d6select stap_fbscan_extogen stap_fbscan_extogsig_b stap_fbscan_highz stap_fbscan_intest_mode stap_fbscan_mode stap_fbscan_runbist_en stap_fbscan_shiftdr stap_fbscan_tck stap_fbscan_updatedr stap_fbscan_updatedr_clk } 

# SDC file generated by FishTail Refocus version 2017.07e
# SDC file generated by FishTail Refocus version 2017.07e
# From /nfs/iind/disks/dteg_disk008/users/badithya/dteg-stap/target/stap/ADL/mat1.5.3.p0_p1274.7/aceroot/results/DC/stap/collateral/timing_common/stap_internal_exceptions.tcl line 6
set_false_path \
  -from { ftap_tdi } \
  -to { atapsslv_tdo } 

# From /nfs/iind/disks/dteg_disk008/users/badithya/dteg-stap/target/stap/ADL/mat1.5.3.p0_p1274.7/aceroot/results/DC/stap/collateral/timing_common/stap_internal_exceptions.tcl line 7
set_false_path \
  -from { ftapsslv_tdi } \
  -to { atap_tdo } 

# From /nfs/iind/disks/dteg_disk008/users/badithya/dteg-stap/target/stap/ADL/mat1.5.3.p0_p1274.7/aceroot/results/DC/stap/collateral/timing_common/stap_internal_exceptions.tcl line 9
set_false_path \
  -from { fdfx_earlyboot_exit } 

# From /nfs/iind/disks/dteg_disk008/users/badithya/dteg-stap/target/stap/ADL/mat1.5.3.p0_p1274.7/aceroot/results/DC/stap/collateral/timing_common/stap_internal_exceptions.tcl line 10
set_false_path \
  -from { fdfx_powergood } 

# From /nfs/iind/disks/dteg_disk008/users/badithya/dteg-stap/target/stap/ADL/mat1.5.3.p0_p1274.7/aceroot/results/DC/stap/collateral/timing_common/stap_internal_exceptions.tcl line 12
set_max_delay \
  -from { ftap_tdi } \
  -to { atap_tdo } \
   5000.0 

# From /nfs/iind/disks/dteg_disk008/users/badithya/dteg-stap/target/stap/ADL/mat1.5.3.p0_p1274.7/aceroot/results/DC/stap/collateral/timing_common/stap_internal_exceptions.tcl line 13
set_max_delay \
  -from { ftapsslv_tdi } \
  -to { atapsslv_tdo } \
   5000.0 

