#Generated by Design Compiler(L-2016.03-SP3) on Fri Nov 10 21:07:12 2017

if {[info exists synopsys_program_name]} {
if {[info exists synopsys_program_name] && (($synopsys_program_name == "dc_shell") || ($synopsys_program_name == "icc_shell") || ($synopsys_program_name == "icc2_shell") )} {
set_design_attributes -elements {.} -attribute   \
  lower_domain_boundary false
}
}
create_power_domain pd_stap_AON -include_scope
create_supply_port vccst  -domain pd_stap_AON    \
  -direction in
create_supply_net vccst  -domain pd_stap_AON 
connect_supply_net vccst -ports vccst
create_supply_port vss  -domain pd_stap_AON      \
  -direction in
create_supply_net vss  -domain pd_stap_AON 
connect_supply_net vss -ports vss
create_power_domain pd_stap_VNN -elements        \
  generate_stap_swcomp_rtdr_i_stap_swcomp_rtdr
create_supply_port vccsa  -domain pd_stap_VNN    \
  -direction in
create_supply_net vccsa  -domain pd_stap_VNN 
connect_supply_net vccsa -ports vccsa
create_supply_net vccst  -domain pd_stap_VNN     \
  -reuse 
create_supply_net vss  -domain pd_stap_VNN       \
  -reuse 
set_domain_supply_net pd_stap_AON                \
  -primary_power_net vccst  -primary_ground_net  \
  vss
set_domain_supply_net pd_stap_VNN                \
  -primary_power_net vccsa  -primary_ground_net  \
  vss
set_isolation i_from_vccsa_to_outputs  -domain   \
  pd_stap_VNN  -isolation_power_net vccst        \
  -isolation_ground_net vss  -elements           \
  {generate_stap_swcomp_rtdr_i_stap_swcomp_rtdr/swcomp_stap_post_tdo \
  generate_stap_swcomp_rtdr_i_stap_swcomp_rtdr/swcompstat_tdo \
  generate_stap_swcomp_rtdr_i_stap_swcomp_rtdr/swcompctrl_tdo} \
  -clamp_value 0 
set_isolation_control i_from_vccsa_to_outputs    \
  -domain pd_stap_VNN -isolation_signal          \
  stap_isol_en_b -isolation_sense low -location  \
  self
add_port_state vccsa -state {ps_VCCSA 0.750000}
add_port_state vccsa -state {ps_VCCSA_OFF off}
add_port_state vccst -state {ps_VCCST 0.750000}
add_port_state vccst -state {ps_VCCST_OFF off}
add_port_state vss -state {ps_GROUND 0.000000}
create_pst pst_stap -supplies [list vccsa vccst  \
  vss]
add_pst_state S0  -pst pst_stap  -state          \
  {ps_VCCSA ps_VCCST ps_GROUND}
add_pst_state S0i1  -pst pst_stap  -state        \
  {ps_VCCSA_OFF ps_VCCST ps_GROUND}
add_pst_state G3_OFF  -pst pst_stap  -state      \
  {ps_VCCSA_OFF ps_VCCST_OFF ps_GROUND}

set derived_upf true
#Design Compiler added commands
set_isolation snps_no_iso__0  -domain            \
  pd_stap_VNN  -elements                         \
  generate_stap_swcomp_rtdr_i_stap_swcomp_rtdr/iso \
  -no_isolation
set derived_upf false


