# SDC file generated by FishTail categorize_unmapped_constraints based on mapped sdc file ../setup/mapped.sdc

# constraint on line 6 of /nfs/iind/disks/dteg_disk008/users/badithya/dteg-stap/target/stap/ADL/mat1.5.9.p0_p1274.7/aceroot/results/DC/stap/collateral/fishtail/stap_internal_exceptions.tcl:
## synthesis contraints start from here
# MCP is Required only for valid use case
# set_multicycle_path -setup 2 -end -from [ get_pins i_stap_drreg/tdr_data_out]
# set_multicycle_path -hold  1 -end -from [ get_pins i_stap_drreg/tdr_data_out]
##False Paths
# set_false_path -from [get_ports ftap_tdi] -to [get_ports atapsslv_tdo]
set_false_path \
  -from { ftap_tdi } \
  -to { atapsslv_tdo } 

# constraint on line 7 of /nfs/iind/disks/dteg_disk008/users/badithya/dteg-stap/target/stap/ADL/mat1.5.9.p0_p1274.7/aceroot/results/DC/stap/collateral/fishtail/stap_internal_exceptions.tcl:
# set_false_path -from [get_ports ftapsslv_tdi] -to [get_ports atap_tdo]
set_false_path \
  -from { ftapsslv_tdi } \
  -to { atap_tdo } 

# constraint on line 9 of /nfs/iind/disks/dteg_disk008/users/badithya/dteg-stap/target/stap/ADL/mat1.5.9.p0_p1274.7/aceroot/results/DC/stap/collateral/fishtail/stap_internal_exceptions.tcl:

# set_false_path -from [get_ports fdfx_earlyboot_exit]
set_false_path \
  -from { fdfx_earlyboot_exit } 

# constraint on line 10 of /nfs/iind/disks/dteg_disk008/users/badithya/dteg-stap/target/stap/ADL/mat1.5.9.p0_p1274.7/aceroot/results/DC/stap/collateral/fishtail/stap_internal_exceptions.tcl:
# set_false_path -from [get_ports fdfx_powergood]
set_false_path \
  -from { fdfx_powergood } 

# constraint on line 12 of /nfs/iind/disks/dteg_disk008/users/badithya/dteg-stap/target/stap/ADL/mat1.5.9.p0_p1274.7/aceroot/results/DC/stap/collateral/fishtail/stap_internal_exceptions.tcl:
##Max Delay Constraints
# set_max_delay [expr 0.5 * $ftap_tck_period] -from [get_ports ftap_tdi] -to [get_ports atap_tdo]
set_max_delay \
  -from { ftap_tdi } \
  -to { atap_tdo } \
   1041.66666667 

# constraint on line 13 of /nfs/iind/disks/dteg_disk008/users/badithya/dteg-stap/target/stap/ADL/mat1.5.9.p0_p1274.7/aceroot/results/DC/stap/collateral/fishtail/stap_internal_exceptions.tcl:
# set_max_delay [expr 0.5 * $ftap_tck_period] -from [get_ports ftapsslv_tdi] -to [get_ports atapsslv_tdo]
set_max_delay \
  -from { ftapsslv_tdi } \
  -to { atapsslv_tdo } \
   1041.66666667 

