###################################################################

# Created by write_sdc on Fri Jul 27 10:53:33 2018

###################################################################
set sdc_version 2.0

set_units -time ps -resistance kOhm -capacitance fF -voltage V -current mA
set_operating_conditions typical_1.00 -library e05_nn_p1274d0_tttt_v065_t100_max
set_ideal_network -no_propagate  [get_ports ftap_tck]
set_ideal_network -no_propagate  [get_ports ftapsslv_tck]
set_ideal_network -no_propagate  [get_pins i_stap_ctech_lib_clk_buf_rtdr_i_ctech_lib_clk_buf_ctech_lib_clk_buf_dcszo/clkout]
set_ideal_network -no_propagate  [get_pins i_stap_glue/i_stap_ctech_lib_clk_buf_tck2_i_ctech_lib_clk_buf_ctech_lib_clk_buf_dcszo/clkout]
create_clock [get_ports ftap_tck]  -period 2083.33  -waveform {0 1041.67}
set_clock_uncertainty 300  [get_clocks ftap_tck]
set_clock_transition -max -rise 208.333 [get_clocks ftap_tck]
set_clock_transition -max -fall 208.333 [get_clocks ftap_tck]
set_clock_transition -min -rise 208.333 [get_clocks ftap_tck]
set_clock_transition -min -fall 208.333 [get_clocks ftap_tck]
create_clock [get_ports ftapsslv_tck]  -period 2083.33  -waveform {0 1041.67}
set_clock_uncertainty 300  [get_clocks ftapsslv_tck]
set_clock_transition -max -rise 208.333 [get_clocks ftapsslv_tck]
set_clock_transition -max -fall 208.333 [get_clocks ftapsslv_tck]
set_clock_transition -min -rise 208.333 [get_clocks ftapsslv_tck]
set_clock_transition -min -fall 208.333 [get_clocks ftapsslv_tck]
group_path -name FEED_THROUGH  -from [get_ports ftap_tdi]  -to [get_ports atapsslv_tdo]
group_path -name FEED_THROUGH  -from [get_ports ftap_tdi]  -to [get_ports atap_tdo]
group_path -name FEED_THROUGH  -from [get_ports ftapsslv_tdi]  -to [get_ports atap_tdo]
group_path -name FEED_THROUGH  -from [get_ports ftapsslv_tdi]  -to [get_ports atapsslv_tdo]
group_path -name FEED_THROUGH  -from [list [get_ports ftap_tms] [get_ports ftap_trst_b] [get_ports {ftap_slvidcode[31]}] [get_ports {ftap_slvidcode[30]}] [get_ports {ftap_slvidcode[29]}] [get_ports {ftap_slvidcode[28]}] [get_ports {ftap_slvidcode[27]}] [get_ports {ftap_slvidcode[26]}] [get_ports {ftap_slvidcode[25]}] [get_ports {ftap_slvidcode[24]}] [get_ports {ftap_slvidcode[23]}] [get_ports {ftap_slvidcode[22]}] [get_ports {ftap_slvidcode[21]}] [get_ports {ftap_slvidcode[20]}] [get_ports {ftap_slvidcode[19]}] [get_ports {ftap_slvidcode[18]}] [get_ports {ftap_slvidcode[17]}] [get_ports {ftap_slvidcode[16]}] [get_ports {ftap_slvidcode[15]}] [get_ports {ftap_slvidcode[14]}] [get_ports {ftap_slvidcode[13]}] [get_ports {ftap_slvidcode[12]}] [get_ports {ftap_slvidcode[11]}] [get_ports {ftap_slvidcode[10]}] [get_ports {ftap_slvidcode[9]}] [get_ports {ftap_slvidcode[8]}] [get_ports {ftap_slvidcode[7]}] [get_ports {ftap_slvidcode[6]}] [get_ports {ftap_slvidcode[5]}] [get_ports {ftap_slvidcode[4]}] [get_ports {ftap_slvidcode[3]}] [get_ports {ftap_slvidcode[2]}] [get_ports {ftap_slvidcode[1]}] [get_ports {ftap_slvidcode[0]}] [get_ports fdfx_powergood] [get_ports {tdr_data_in[0]}] [get_ports {fdfx_secure_policy[3]}] [get_ports {fdfx_secure_policy[2]}] [get_ports {fdfx_secure_policy[1]}] [get_ports {fdfx_secure_policy[0]}] [get_ports fdfx_earlyboot_exit] [get_ports fdfx_policy_update] [get_ports sntapnw_atap_tdo] [get_ports {sntapnw_atap_tdo_en[0]}] [get_ports ftapsslv_tms] [get_ports ftapsslv_trst_b] [get_ports sntapnw_atap_tdo2] [get_ports {sntapnw_atap_tdo2_en[0]}] [get_ports {sn_awtap_wso[0]}] [get_ports stap_abscan_tdo] [get_ports ftap_pwrdomain_rst_b] [get_ports {rtdr_tap_tdo[0]}] [get_ports stap_isol_en_b]]  -to [list [get_ports atap_tdo] [get_ports atap_tdoen] [get_ports {tdr_data_out[0]}] [get_ports {sftapnw_ftap_secsel[0]}] [get_ports {sftapnw_ftap_enabletdo[0]}] [get_ports {sftapnw_ftap_enabletap[0]}] [get_ports sntapnw_ftap_tck] [get_ports sntapnw_ftap_tms] [get_ports sntapnw_ftap_trst_b] [get_ports sntapnw_ftap_tdi] [get_ports atapsslv_tdo] [get_ports atapsslv_tdoen] [get_ports sntapnw_ftap_tck2] [get_ports sntapnw_ftap_tms2] [get_ports sntapnw_ftap_trst2_b] [get_ports sntapnw_ftap_tdi2] [get_ports sn_fwtap_wrck] [get_ports sn_fwtap_wrst_b] [get_ports sn_fwtap_capturewr] [get_ports sn_fwtap_shiftwr] [get_ports sn_fwtap_updatewr] [get_ports sn_fwtap_rti] [get_ports sn_fwtap_selectwir] [get_ports {sn_fwtap_wsi[0]}] [get_ports stap_fbscan_tck] [get_ports stap_fbscan_capturedr] [get_ports stap_fbscan_shiftdr] [get_ports stap_fbscan_updatedr] [get_ports stap_fbscan_updatedr_clk] [get_ports stap_fbscan_runbist_en] [get_ports stap_fbscan_highz] [get_ports stap_fbscan_extogen] [get_ports stap_fbscan_intest_mode] [get_ports stap_fbscan_chainen] [get_ports stap_fbscan_mode] [get_ports stap_fbscan_extogsig_b] [get_ports stap_fsm_tlrs] [get_ports stap_fbscan_d6init] [get_ports stap_fbscan_d6actestsig_b] [get_ports stap_fbscan_d6select] [get_ports {tap_rtdr_irdec[0]}] [get_ports {tap_rtdr_prog_rst_b[0]}] [get_ports {tap_rtdr_tdi[0]}] [get_ports {tap_rtdr_capture[0]}] [get_ports {tap_rtdr_shift[0]}] [get_ports {tap_rtdr_update[0]}] [get_ports tap_rtdr_tck] [get_ports tap_rtdr_powergood] [get_ports tap_rtdr_selectir] [get_ports tap_rtdr_rti]]
group_path -name FEED_THROUGH  -from [get_ports ftapsslv_tdi]  -to [list [get_ports atap_tdoen] [get_ports {tdr_data_out[0]}] [get_ports {sftapnw_ftap_secsel[0]}] [get_ports {sftapnw_ftap_enabletdo[0]}] [get_ports {sftapnw_ftap_enabletap[0]}] [get_ports sntapnw_ftap_tck] [get_ports sntapnw_ftap_tms] [get_ports sntapnw_ftap_trst_b] [get_ports sntapnw_ftap_tdi] [get_ports atapsslv_tdoen] [get_ports sntapnw_ftap_tck2] [get_ports sntapnw_ftap_tms2] [get_ports sntapnw_ftap_trst2_b] [get_ports sntapnw_ftap_tdi2] [get_ports sn_fwtap_wrck] [get_ports sn_fwtap_wrst_b] [get_ports sn_fwtap_capturewr] [get_ports sn_fwtap_shiftwr] [get_ports sn_fwtap_updatewr] [get_ports sn_fwtap_rti] [get_ports sn_fwtap_selectwir] [get_ports {sn_fwtap_wsi[0]}] [get_ports stap_fbscan_tck] [get_ports stap_fbscan_capturedr] [get_ports stap_fbscan_shiftdr] [get_ports stap_fbscan_updatedr] [get_ports stap_fbscan_updatedr_clk] [get_ports stap_fbscan_runbist_en] [get_ports stap_fbscan_highz] [get_ports stap_fbscan_extogen] [get_ports stap_fbscan_intest_mode] [get_ports stap_fbscan_chainen] [get_ports stap_fbscan_mode] [get_ports stap_fbscan_extogsig_b] [get_ports stap_fsm_tlrs] [get_ports stap_fbscan_d6init] [get_ports stap_fbscan_d6actestsig_b] [get_ports stap_fbscan_d6select] [get_ports {tap_rtdr_irdec[0]}] [get_ports {tap_rtdr_prog_rst_b[0]}] [get_ports {tap_rtdr_tdi[0]}] [get_ports {tap_rtdr_capture[0]}] [get_ports {tap_rtdr_shift[0]}] [get_ports {tap_rtdr_update[0]}] [get_ports tap_rtdr_tck] [get_ports tap_rtdr_powergood] [get_ports tap_rtdr_selectir] [get_ports tap_rtdr_rti]]
group_path -name FEED_THROUGH  -from [get_ports ftap_tdi]  -to [list [get_ports atap_tdoen] [get_ports {tdr_data_out[0]}] [get_ports {sftapnw_ftap_secsel[0]}] [get_ports {sftapnw_ftap_enabletdo[0]}] [get_ports {sftapnw_ftap_enabletap[0]}] [get_ports sntapnw_ftap_tck] [get_ports sntapnw_ftap_tms] [get_ports sntapnw_ftap_trst_b] [get_ports sntapnw_ftap_tdi] [get_ports atapsslv_tdoen] [get_ports sntapnw_ftap_tck2] [get_ports sntapnw_ftap_tms2] [get_ports sntapnw_ftap_trst2_b] [get_ports sntapnw_ftap_tdi2] [get_ports sn_fwtap_wrck] [get_ports sn_fwtap_wrst_b] [get_ports sn_fwtap_capturewr] [get_ports sn_fwtap_shiftwr] [get_ports sn_fwtap_updatewr] [get_ports sn_fwtap_rti] [get_ports sn_fwtap_selectwir] [get_ports {sn_fwtap_wsi[0]}] [get_ports stap_fbscan_tck] [get_ports stap_fbscan_capturedr] [get_ports stap_fbscan_shiftdr] [get_ports stap_fbscan_updatedr] [get_ports stap_fbscan_updatedr_clk] [get_ports stap_fbscan_runbist_en] [get_ports stap_fbscan_highz] [get_ports stap_fbscan_extogen] [get_ports stap_fbscan_intest_mode] [get_ports stap_fbscan_chainen] [get_ports stap_fbscan_mode] [get_ports stap_fbscan_extogsig_b] [get_ports stap_fsm_tlrs] [get_ports stap_fbscan_d6init] [get_ports stap_fbscan_d6actestsig_b] [get_ports stap_fbscan_d6select] [get_ports {tap_rtdr_irdec[0]}] [get_ports {tap_rtdr_prog_rst_b[0]}] [get_ports {tap_rtdr_tdi[0]}] [get_ports {tap_rtdr_capture[0]}] [get_ports {tap_rtdr_shift[0]}] [get_ports {tap_rtdr_update[0]}] [get_ports tap_rtdr_tck] [get_ports tap_rtdr_powergood] [get_ports tap_rtdr_selectir] [get_ports tap_rtdr_rti]]
group_path -name INPUT_PATHS  -from [get_ports fdfx_powergood]
group_path -name INPUT_PATHS  -from [get_ports fdfx_earlyboot_exit]
group_path -name INPUT_PATHS  -from [list [get_ports ftap_tms] [get_ports ftap_trst_b] [get_ports ftap_tdi] [get_ports {ftap_slvidcode[31]}] [get_ports {ftap_slvidcode[30]}] [get_ports {ftap_slvidcode[29]}] [get_ports {ftap_slvidcode[28]}] [get_ports {ftap_slvidcode[27]}] [get_ports {ftap_slvidcode[26]}] [get_ports {ftap_slvidcode[25]}] [get_ports {ftap_slvidcode[24]}] [get_ports {ftap_slvidcode[23]}] [get_ports {ftap_slvidcode[22]}] [get_ports {ftap_slvidcode[21]}] [get_ports {ftap_slvidcode[20]}] [get_ports {ftap_slvidcode[19]}] [get_ports {ftap_slvidcode[18]}] [get_ports {ftap_slvidcode[17]}] [get_ports {ftap_slvidcode[16]}] [get_ports {ftap_slvidcode[15]}] [get_ports {ftap_slvidcode[14]}] [get_ports {ftap_slvidcode[13]}] [get_ports {ftap_slvidcode[12]}] [get_ports {ftap_slvidcode[11]}] [get_ports {ftap_slvidcode[10]}] [get_ports {ftap_slvidcode[9]}] [get_ports {ftap_slvidcode[8]}] [get_ports {ftap_slvidcode[7]}] [get_ports {ftap_slvidcode[6]}] [get_ports {ftap_slvidcode[5]}] [get_ports {ftap_slvidcode[4]}] [get_ports {ftap_slvidcode[3]}] [get_ports {ftap_slvidcode[2]}] [get_ports {ftap_slvidcode[1]}] [get_ports {ftap_slvidcode[0]}] [get_ports {tdr_data_in[0]}] [get_ports {fdfx_secure_policy[3]}] [get_ports {fdfx_secure_policy[2]}] [get_ports {fdfx_secure_policy[1]}] [get_ports {fdfx_secure_policy[0]}] [get_ports fdfx_policy_update] [get_ports sntapnw_atap_tdo] [get_ports {sntapnw_atap_tdo_en[0]}] [get_ports ftapsslv_tms] [get_ports ftapsslv_trst_b] [get_ports ftapsslv_tdi] [get_ports sntapnw_atap_tdo2] [get_ports {sntapnw_atap_tdo2_en[0]}] [get_ports {sn_awtap_wso[0]}] [get_ports stap_abscan_tdo] [get_ports ftap_pwrdomain_rst_b] [get_ports {rtdr_tap_tdo[0]}] [get_ports stap_isol_en_b]]
group_path -name OUTPUT_PATHS  -to [list [get_ports atap_tdo] [get_ports atap_tdoen] [get_ports {tdr_data_out[0]}] [get_ports {sftapnw_ftap_secsel[0]}] [get_ports {sftapnw_ftap_enabletdo[0]}] [get_ports {sftapnw_ftap_enabletap[0]}] [get_ports sntapnw_ftap_tck] [get_ports sntapnw_ftap_tms] [get_ports sntapnw_ftap_trst_b] [get_ports sntapnw_ftap_tdi] [get_ports atapsslv_tdo] [get_ports atapsslv_tdoen] [get_ports sntapnw_ftap_tck2] [get_ports sntapnw_ftap_tms2] [get_ports sntapnw_ftap_trst2_b] [get_ports sntapnw_ftap_tdi2] [get_ports sn_fwtap_wrck] [get_ports sn_fwtap_wrst_b] [get_ports sn_fwtap_capturewr] [get_ports sn_fwtap_shiftwr] [get_ports sn_fwtap_updatewr] [get_ports sn_fwtap_rti] [get_ports sn_fwtap_selectwir] [get_ports {sn_fwtap_wsi[0]}] [get_ports stap_fbscan_tck] [get_ports stap_fbscan_capturedr] [get_ports stap_fbscan_shiftdr] [get_ports stap_fbscan_updatedr] [get_ports stap_fbscan_updatedr_clk] [get_ports stap_fbscan_runbist_en] [get_ports stap_fbscan_highz] [get_ports stap_fbscan_extogen] [get_ports stap_fbscan_intest_mode] [get_ports stap_fbscan_chainen] [get_ports stap_fbscan_mode] [get_ports stap_fbscan_extogsig_b] [get_ports stap_fsm_tlrs] [get_ports stap_fbscan_d6init] [get_ports stap_fbscan_d6actestsig_b] [get_ports stap_fbscan_d6select] [get_ports {tap_rtdr_irdec[0]}] [get_ports {tap_rtdr_prog_rst_b[0]}] [get_ports {tap_rtdr_tdi[0]}] [get_ports {tap_rtdr_capture[0]}] [get_ports {tap_rtdr_shift[0]}] [get_ports {tap_rtdr_update[0]}] [get_ports tap_rtdr_tck] [get_ports tap_rtdr_powergood] [get_ports tap_rtdr_selectir] [get_ports tap_rtdr_rti]]
set_false_path   -from [get_ports ftap_tdi]  -to [get_ports atapsslv_tdo]
set_max_delay 5000  -from [get_ports ftap_tdi]  -to [get_ports atap_tdo]
set_false_path   -from [get_ports ftapsslv_tdi]  -to [get_ports atap_tdo]
set_max_delay 5000  -from [get_ports ftapsslv_tdi]  -to [get_ports atapsslv_tdo]
set_false_path   -from [get_ports fdfx_powergood]
set_false_path   -from [get_ports fdfx_earlyboot_exit]
set_input_delay -clock ftapsslv_tck  1000  [get_ports ftap_tck]
set_input_delay -clock ftapsslv_tck  0  [get_ports ftapsslv_tck]
set_input_delay -clock ftapsslv_tck  1000  [get_ports ftap_tdi]
set_input_delay -clock ftapsslv_tck  1000  [get_ports ftapsslv_tdi]
set_input_delay -clock ftapsslv_tck  1000  [get_ports ftap_tms]
set_input_delay -clock ftapsslv_tck  500  [get_ports ftap_trst_b]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {ftap_slvidcode[31]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {ftap_slvidcode[30]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {ftap_slvidcode[29]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {ftap_slvidcode[28]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {ftap_slvidcode[27]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {ftap_slvidcode[26]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {ftap_slvidcode[25]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {ftap_slvidcode[24]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {ftap_slvidcode[23]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {ftap_slvidcode[22]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {ftap_slvidcode[21]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {ftap_slvidcode[20]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {ftap_slvidcode[19]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {ftap_slvidcode[18]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {ftap_slvidcode[17]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {ftap_slvidcode[16]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {ftap_slvidcode[15]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {ftap_slvidcode[14]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {ftap_slvidcode[13]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {ftap_slvidcode[12]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {ftap_slvidcode[11]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {ftap_slvidcode[10]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {ftap_slvidcode[9]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {ftap_slvidcode[8]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {ftap_slvidcode[7]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {ftap_slvidcode[6]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {ftap_slvidcode[5]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {ftap_slvidcode[4]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {ftap_slvidcode[3]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {ftap_slvidcode[2]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {ftap_slvidcode[1]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {ftap_slvidcode[0]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports fdfx_powergood]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {tdr_data_in[0]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {fdfx_secure_policy[3]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {fdfx_secure_policy[2]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {fdfx_secure_policy[1]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {fdfx_secure_policy[0]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports fdfx_earlyboot_exit]
set_input_delay -clock ftapsslv_tck  1000  [get_ports fdfx_policy_update]
set_input_delay -clock ftapsslv_tck  1000  [get_ports sntapnw_atap_tdo]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {sntapnw_atap_tdo_en[0]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports ftapsslv_tms]
set_input_delay -clock ftapsslv_tck  1000  [get_ports ftapsslv_trst_b]
set_input_delay -clock ftapsslv_tck  1000  [get_ports sntapnw_atap_tdo2]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {sntapnw_atap_tdo2_en[0]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {sn_awtap_wso[0]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports stap_abscan_tdo]
set_input_delay -clock ftapsslv_tck  500  [get_ports ftap_pwrdomain_rst_b]
set_input_delay -clock ftapsslv_tck  1000  [get_ports {rtdr_tap_tdo[0]}]
set_input_delay -clock ftapsslv_tck  1000  [get_ports stap_isol_en_b]
set_output_delay -clock ftapsslv_tck  500  [get_ports atapsslv_tdo]
set_output_delay -clock ftapsslv_tck  500  [get_ports atap_tdo]
set_output_delay -clock ftapsslv_tck  500  [get_ports atap_tdoen]
set_output_delay -clock ftapsslv_tck  500  [get_ports {tdr_data_out[0]}]
set_output_delay -clock ftapsslv_tck  500  [get_ports {sftapnw_ftap_secsel[0]}]
set_output_delay -clock ftapsslv_tck  500  [get_ports {sftapnw_ftap_enabletdo[0]}]
set_output_delay -clock ftapsslv_tck  500  [get_ports {sftapnw_ftap_enabletap[0]}]
set_output_delay -clock ftapsslv_tck  500  [get_ports sntapnw_ftap_tck]
set_output_delay -clock ftapsslv_tck  500  [get_ports sntapnw_ftap_tms]
set_output_delay -clock ftapsslv_tck  500  [get_ports sntapnw_ftap_trst_b]
set_output_delay -clock ftapsslv_tck  500  [get_ports sntapnw_ftap_tdi]
set_output_delay -clock ftapsslv_tck  500  [get_ports atapsslv_tdoen]
set_output_delay -clock ftapsslv_tck  500  [get_ports sntapnw_ftap_tck2]
set_output_delay -clock ftapsslv_tck  500  [get_ports sntapnw_ftap_tms2]
set_output_delay -clock ftapsslv_tck  500  [get_ports sntapnw_ftap_trst2_b]
set_output_delay -clock ftapsslv_tck  500  [get_ports sntapnw_ftap_tdi2]
set_output_delay -clock ftapsslv_tck  500  [get_ports sn_fwtap_wrck]
set_output_delay -clock ftapsslv_tck  500  [get_ports sn_fwtap_wrst_b]
set_output_delay -clock ftapsslv_tck  500  [get_ports sn_fwtap_capturewr]
set_output_delay -clock ftapsslv_tck  500  [get_ports sn_fwtap_shiftwr]
set_output_delay -clock ftapsslv_tck  500  [get_ports sn_fwtap_updatewr]
set_output_delay -clock ftapsslv_tck  500  [get_ports sn_fwtap_rti]
set_output_delay -clock ftapsslv_tck  500  [get_ports sn_fwtap_selectwir]
set_output_delay -clock ftapsslv_tck  500  [get_ports {sn_fwtap_wsi[0]}]
set_output_delay -clock ftapsslv_tck  500  [get_ports stap_fbscan_tck]
set_output_delay -clock ftapsslv_tck  500  [get_ports stap_fbscan_capturedr]
set_output_delay -clock ftapsslv_tck  500  [get_ports stap_fbscan_shiftdr]
set_output_delay -clock ftapsslv_tck  500  [get_ports stap_fbscan_updatedr]
set_output_delay -clock ftapsslv_tck  500  [get_ports stap_fbscan_updatedr_clk]
set_output_delay -clock ftapsslv_tck  500  [get_ports stap_fbscan_runbist_en]
set_output_delay -clock ftapsslv_tck  500  [get_ports stap_fbscan_highz]
set_output_delay -clock ftapsslv_tck  500  [get_ports stap_fbscan_extogen]
set_output_delay -clock ftapsslv_tck  500  [get_ports stap_fbscan_intest_mode]
set_output_delay -clock ftapsslv_tck  500  [get_ports stap_fbscan_chainen]
set_output_delay -clock ftapsslv_tck  500  [get_ports stap_fbscan_mode]
set_output_delay -clock ftapsslv_tck  500  [get_ports stap_fbscan_extogsig_b]
set_output_delay -clock ftapsslv_tck  500  [get_ports stap_fsm_tlrs]
set_output_delay -clock ftapsslv_tck  500  [get_ports stap_fbscan_d6init]
set_output_delay -clock ftapsslv_tck  500  [get_ports stap_fbscan_d6actestsig_b]
set_output_delay -clock ftapsslv_tck  500  [get_ports stap_fbscan_d6select]
set_output_delay -clock ftapsslv_tck  500  [get_ports {tap_rtdr_irdec[0]}]
set_output_delay -clock ftapsslv_tck  500  [get_ports {tap_rtdr_prog_rst_b[0]}]
set_output_delay -clock ftapsslv_tck  500  [get_ports {tap_rtdr_tdi[0]}]
set_output_delay -clock ftapsslv_tck  500  [get_ports {tap_rtdr_capture[0]}]
set_output_delay -clock ftapsslv_tck  500  [get_ports {tap_rtdr_shift[0]}]
set_output_delay -clock ftapsslv_tck  500  [get_ports {tap_rtdr_update[0]}]
set_output_delay -clock ftapsslv_tck  500  [get_ports tap_rtdr_tck]
set_output_delay -clock ftapsslv_tck  500  [get_ports tap_rtdr_powergood]
set_output_delay -clock ftapsslv_tck  500  [get_ports tap_rtdr_selectir]
set_output_delay -clock ftapsslv_tck  500  [get_ports tap_rtdr_rti]
